Repository: petra1/a_demonstration
Catalog: lib/l10n/app_*.arb
Languages: de

source: Alternative Text
de: Alternativtext

source: Image Buttons
de: Grafische Schalter

source: Headings
de: Überschriften

source: Edit Fields
de: Eingabefelder

# checkBoxes
source: Checknoxes
de: Kontrollkästchen

source: Contrast Ratio
de: Kontrastverhältnis

source: Focus Order
de: Fokus-Reihenfolge

source: Focus Visible
de: Focus Sichtbar

source: Privacy & Contact
de: Datenschutz & Kontakt

source: Help
de: Hilfe

# about
source: About App
de: Über die App

# altDescription
source: The following will show what is read by screen readers in the three most common situations (no alternative text, decorative graphics, and informative graphics).
de: Im Folgenden wird gezeigt, was von Screenreader in den drei häufigsten Situationen vorgelesen wird (kein Alternativtext, dekorative Grafiken und informative Grafiken).

# noAltText
source: No Alternative Text
de: Fehlender Alternativtext

# noAltDescription
source: In this example, the alternative text was intentionally omitted. In practice, it happens very often that the alternative text is omitted by mistake
de: In diesem Beispiel wurde der Alternativtext absichtlich weggelassen. In der Praxis kommt es sehr oft vor, dass der Alternativtext versehentlich weggelassen wird.

source: Decorative Graphics
de: Dekorative Grafiken

# decorativeGraphicDescriptions
source: In this example, the graphic was assumed to be purely decorative and the alternative text was left blank so that screen readers ignores the graphic and does not output unnecessary text.
de: Diese Grafik ist rein dekorativ, und der Alternativtext wurde leer gelassen, damit Screenreader die Grafik ignoriert und kein unnötigen Text ausgibt.

source: Informative Graphic
de: Informative Grafik

# informativeGraphicDescription
source: In this example, the graphic was assumed to be informative, so it was provided with an alternative text.
de: In diesem Beispiel wurde davon ausgegangen, dass die Grafik informativ ist, weshalb sie mit einem Alternativtext versehen wurde.

# description1ImageButton
source: This example shows how screen readers behave with graphic buttons that lack alternative text, and at the same time shows how the buttons can be made more usable for people with limited fine motor skills.
de: Dieses Beispiel zeigt, wie sich Screenreader bei grafischen Schaltflächen verhält, die keinen Alternativtext enthalten, und zeigt gleichzeitig, wie die Schaltflächen für Menschen mit eingeschränkter Feinmotorik besser nutzbar gemacht werden können.

# description2ImageButton
source: In the first input field, the link to the visible label was intentionally omitted. The second is correctly linked to the label.
de: Bei der ersten grafischen Schaltfläche wurde der Alternativtext absichtlich weggelassen und auch das Touch-Target wurde nicht angepasst. Die zweite grafische Schaltfläche hingegen wurde korrekt beschriftet und das Touch-Target wurde angepasst, so dass die Schaltfläche größer dargestellt wird und somit leichter zu bedienen ist.

# question1ImageButton
source: Question #1: What is the current version of WCAG?
de: Frage 1: Was ist die aktuelle Version der WCAG?

# answer1ImageButton
source: The current version of WCAG is 2.2.
de: Die aktuelle Version der WCAG ist 2.2.

# question2ImageButton
source: Question #2: When was the current version of WCAG released?
de: Frage 2: Wann wurde die aktuelle Version der WCAG veröffentlicht?

# answer2ImageButton
source: The current version was released in October 2023.
de: Die aktuelle Version wurde im Oktober 2023 veröffentlicht.

# helpQuestion2Button
source: Help for question 2
de: Hilfe für Frage 2.

# resetButton
source: Reset questions
de: Fragen zurücksetzen

# contrastRadioDescription
source: The contrast ratio is often not given enough attention in the development of mobile apps. However, especially in mobile use, a good contrast ratio is important for all users, e.g. when using mobile devices outdoors in sunshine. Below you will find some examples of good and bad contrast ratios.
de: Dem Kontrastverhältnis wird bei der Entwicklung mobiler Apps oft nicht genügend Aufmerksamkeit geschenkt. Gerade bei der mobilen Nutzung ist ein gutes Kontrastverhältnis jedoch für alle Nutzenden wichtig, z.B. bei der Nutzung mobiler Geräte im Freien bei Sonnenschein. Nachfolgend finden Sie einige Beispiele für gute und schlechte Kontrastverhältnisse.

# contrastRadioPassed
source: Passed with 21.0:1, HEX: #ffffff on #000000
de: Bestanden mit 21.0:1, HEX: #ffffff auf #000000.

# contrastRadioFailed
source: Failed with 2.3:1, HEX: #ffffff on #a0b0a1.
de: Nicht bestanden mit 2.3:1, HEX: #ffffff auf #a0b0a1

# contrastRadioJustPassed
source: Just passed with 4.5:1, HEX: #00e9ff on #5a4dad.
de: Gerade noch bestanden mit 4,5:1, HEX: #00e9ff auf #5a4dad.

# contrastRadioJustFailed
source: Just failed with 4.4:1, HEX: #ffffff on #0083a1.
de: Knapp nicht bestanden mit 4.4:1, HEX: #ffffff auf #0083a1.

# contrastRadioPassedWith
source: Passed with contrast ratio of? HEX #ffffff on #006400.
de: Bestanden mit einem Kontrastverhälnis von? HEX #ffffff auf #006400.

# contrastRadioFaileddWith
source: Failed with contrast ratio of? HEX on #bb86fc.
de: Nicht bestanden mit einem Kontrastverhälnis von? HEX #ffffff auf #bb86fc.

# tabOrderDescription1
source: People with limited fine motor skills may not be able to operate a touch screen. It is therefore important that an app can also be operated with a keyboard connected via Bluetooth and that the focus order of the operating elements is correct.
de: Menschen mit eingeschränkter Feinmotorik sind möglicherweise nicht in der Lage, einen Touchscreen zu bedienen. Daher ist es wichtig, dass eine App auch mit einer über Bluetooth angeschlossenen Tastatur bedient werden kann und dass die Fokusreihenfolge der Bedienelemente korrekt ist.

# editFieldsDescription1
source: In the following, we will show how screen readers behave when the visually visible labels have not been linked to the corresponding input field.
de: Im Folgenden wird gezeigt, wie sich Screenreader verhalten, wenn die visuell sichtbaren Labels nicht mit dem entsprechenden Eingabefeld verknüpft sind.

# editFieldsDescription2
source: No label was intentionally used in the first edit field. The second was labelled correctly.
de: Im ersten Eingabefeld wurde absichtlich kein label verwendet. Das zweite wurde korrekt mit einem Label versehen.

# firstEditFieldHint
source: First name
de: Vorname

# secondEditFieldLabel
source: Last name
de: Nachname

# buttonDisplayFullName
source: Display full Name
de: Vollständigen Namen anzeigen

# focusVisibleDescription1
source: People with motor disabilities may have difficulty or be unable to operate a touch screen and therefore use a Bluetooth keyboard. This requires, among other things, that the keyboard focus is sufficiently visible.
de: Motorischbehinderte Menschen haben möglicherweise Mühe oder sind nicht in der Lage einen Touch-Screen zu bedienen und verwenden daher eine Bluetooth-Tastatur. Dies setz unter anderem voraus, dass der Tastaturfokus genügend sichtbar ist.

# focusVisibleDescription2
source: In this example, the visibility of the keyboard focus was intentionally ignored for some button. Try using a Bluetooth keyboard paired with the mobile device and try to find and activate button 3 without counting how many times you press the Tab key.
de: In diesem Beispiel wurde die Sichtbarkeit des Tastaturfokus für einige Schalter absichtlich ignoriert. Verwenden Sie, einer mit dem mobilen Gerät gekoppelte Bluetooth-Tastatur und versuchen, die Taste 3 zu finden und zu aktivieren, ohne zu zählen, wie oft Sie die Tab-Taste drücken.

# toastButton1
source: You have pressed button 1.
de: Sie haben Taste 1 gedrückt.

# toastButton2
source: You have pressed button 2.
de: Sie haben Taste 2 gedrückt.

# toastButton3
source: You have pressed button 3.
de: Sie haben Taste 3 gedrückt.

# toastButton4
source: You have pressed button 4.
de: Sie haben Taste 4 gedrückt.

# toastButton5
source: You have pressed button 5.
de: Sie haben Taste 5 gedrückt.

# toastButton6
source: You have pressed button 6.
de: Sie haben Taste 6 gedrückt.
